Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
/******************************************************************************
*
* board.c - 1 sentence file description
* Copyright (c) notice
*
******************************************************************************/
#ifndef __BOARD_C__
#define __BOARD_C__
/******************************************************************************
* includes ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

//Standard includes
  #include <stdint.h>
  #include <stdbool.h>
  #include <string.h>
  #include <stdlib.h>
  #include <stdio.h>

//Project specific includes
  #include "proj_inc/project_config.h"
#if (PROJ_CONFIG_PLATFORM == PROJ_CONFIG_PLATFORM_STM32F4DISC)

//Utility includes
  #include "utils_inc/error_codes.h"
  #include "utils_inc/util_debug.h"
  /* Utility include files here */

//Third party includes
  #include "ThirdParty_inc/osal.h"
  /* Third party include files here */

//Platform includes
  #include "board.h"
  //STM32F4 specific includes
  //#include "stm32f4xx.h"
  #include "stm32f4xx_hal.h"
  #include "core_cm4.h"
  /* Platform include files here */





/******************************************************************************
* defines /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/
//camera defines
#define CAMERA_TIMER_INSTANCE  TIM4
#define CAMERA_I2C_INSTANCE    I2C2
#define I2C_ADDRESS            0x30F

//bluetooth defines
  #define BT_TX_BUF_LEN         512
  #define BT_RX_BUF_LEN       512
  #define BT_UART_HANDLE      huart4
  #define BT_UART_HANDLE_T    UART_HandleTypeDef
  #define BT_INF_IRQ_HANDLER  HAL_UART_RxCpltCallback
  #define BT_INTF_IRQN        USART4_IRQn

//wifi defines
	#define WIFI_TX_BUF_LEN       512
	#define WIFI_RX_BUF_LEN       512
  #define WIFI_UART_HANDLE      huart2
  #define WIFI_UART_HANDLE_T    UART_HandleTypeDef
  #define WIFI_INF_IRQ_HANDLER  HAL_UART_RxCpltCallback
  #define WIFI_INTF_IRQN        USART2_IRQn

//flash defines
#define FLASH_USER_START_ADDR   ADDR_FLASH_SECTOR_11   /* Start @ of user Flash area */
#define FLASH_USER_END_ADDR     ADDR_FLASH_SECTOR_11 + 0x20000   /* End @ of user Flash area */

/* Base address of the Flash sectors */
#define ADDR_FLASH_SECTOR_0     ((uint32_t)0x08000000) /* Base @ of Sector 0, 16 Kbytes */
#define ADDR_FLASH_SECTOR_1     ((uint32_t)0x08004000) /* Base @ of Sector 1, 16 Kbytes */
#define ADDR_FLASH_SECTOR_2     ((uint32_t)0x08008000) /* Base @ of Sector 2, 16 Kbytes */
#define ADDR_FLASH_SECTOR_3     ((uint32_t)0x0800C000) /* Base @ of Sector 3, 16 Kbytes */
#define ADDR_FLASH_SECTOR_4     ((uint32_t)0x08010000) /* Base @ of Sector 4, 64 Kbytes */
#define ADDR_FLASH_SECTOR_5     ((uint32_t)0x08020000) /* Base @ of Sector 5, 128 Kbytes */
#define ADDR_FLASH_SECTOR_6     ((uint32_t)0x08040000) /* Base @ of Sector 6, 128 Kbytes */
#define ADDR_FLASH_SECTOR_7     ((uint32_t)0x08060000) /* Base @ of Sector 7, 128 Kbytes */
#define ADDR_FLASH_SECTOR_8     ((uint32_t)0x08080000) /* Base @ of Sector 8, 128 Kbytes */
#define ADDR_FLASH_SECTOR_9     ((uint32_t)0x080A0000) /* Base @ of Sector 9, 128 Kbytes */
#define ADDR_FLASH_SECTOR_10    ((uint32_t)0x080C0000) /* Base @ of Sector 10, 128 Kbytes */
#define ADDR_FLASH_SECTOR_11    ((uint32_t)0x080E0000) /* Base @ of Sector 11, 128 Kbytes */

/******************************************************************************
* variables ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

//wifi variables
//
uint8_t uiWifi_TX_Buff[WIFI_TX_BUF_LEN];
uint8_t uiWifi_RX_Buff[WIFI_RX_BUF_LEN];

/******************************************************************************
* external variables //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/
extern I2C_HandleTypeDef hi2c2;

extern TIM_HandleTypeDef htim4;

extern UART_HandleTypeDef huart2;

extern UART_HandleTypeDef huart4;
/******************************************************************************
* enums ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* structures //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

typedef struct tBSP_Activity_State
{
  bool bIs_Camera_Intf_Init;
  bool bIs_Wifi_Intf_Init;
  bool bIs_Usb_Intf_Init;
  void * pPointer;
  void (* vUART_ISR[5])(void);
//  void (* vUART_ISR)(void);

}tBSP_Activity_State;

tBSP_Activity_State tBSP_AS =
{
  .bIs_Camera_Intf_Init = false,
  .bIs_Wifi_Intf_Init   = false,
  .bIs_Usb_Intf_Init    = false,
  .pPointer             = NULL,
  .vUART_ISR[0] = NULL,
  .vUART_ISR[1] = NULL,
  .vUART_ISR[2] = NULL,
  .vUART_ISR[3] = NULL,
  .vUART_ISR[4] = NULL,
};

//USART_HandleTypeDef tWifi_UART_Handle;
//UART_HandleTypeDef  tWifi_UART_Handle;
//TIM_HandleTypeDef   tCamera_Timer_Handle;
//I2C_HandleTypeDef   tCamera_I2C_Handle;

/******************************************************************************
* external functions //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

//extern void NVIC_PriorityGroupConfig(uint32_t NVIC_PriorityGroup);

