Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
/******************************************************************************
* private function declarations ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

static ERROR_CODE eBSP_Wifi_Intf_Init(void);
static ERROR_CODE eBSP_Usb_Intf_Init(void);
static uint32_t   uiGetUartBits(UART_DATA_BITS eDataBits);
static uint32_t   uiGetUartParity(UART_PARITY eParity);
static uint32_t   uiGetUartStopBits(UART_STOP_BITS eStopBits);
static uint32_t   uiGetUartFlowControl(UART_FLOW_CONTROL eControl);
static uint32_t   uiGetUartMode(UART_MODE eMode);

/******************************************************************************
* private functions ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: Filename_or_abreviation_funciton
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
static ERROR_CODE eBSP_Wifi_Intf_Init(void)
{
  ERROR_CODE eEC = ER_FAIL;
//  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;
//  GPIO_InitTypeDef      tWifi_GPIO_Init;

  if(tBSP_AS.bIs_Wifi_Intf_Init == false)
  {
////    tWifi_GPIO_Init.Pin       = GPIO_PIN_10 | GPIO_PIN_9;
//    tWifi_GPIO_Init.Pin       = GPIO_PIN_2 | GPIO_PIN_3;
//    tWifi_GPIO_Init.Mode      = GPIO_MODE_AF_PP;//GPIO_MODE_AF_OD;//
//    tWifi_GPIO_Init.Pull      = GPIO_NOPULL;//GPIO_PULLDOWN;//GPIO_PULLUP;//
//    tWifi_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
////    tWifi_GPIO_Init.Alternate = GPIO_AF7_USART1;
//    tWifi_GPIO_Init.Alternate = GPIO_AF7_USART2;
//    HAL_GPIO_Init(GPIOA,&tWifi_GPIO_Init);
//
////    tWifi_UART_Handle.Init.BaudRate    = 115200;//57600;
////    tWifi_UART_Handle.Init.WordLength  = USART_WORDLENGTH_8B;
////    tWifi_UART_Handle.Init.StopBits    = USART_STOPBITS_1;
////    tWifi_UART_Handle.Init.Parity      = USART_PARITY_NONE;
////    tWifi_UART_Handle.Init.Mode        = USART_MODE_TX_RX;
////    tWifi_UART_Handle.Init.CLKPolarity = USART_POLARITY_LOW;//USART_POLARITY_HIGH;//
////    tWifi_UART_Handle.Init.CLKPhase    = USART_PHASE_1EDGE;//USART_PHASE_2EDGE;//
////    tWifi_UART_Handle.Init.CLKLastBit  = USART_LASTBIT_DISABLE;//USART_LASTBIT_ENABLE;//
////    tWifi_UART_Handle.Instance         = USART2;
////    eHAL_Status = HAL_USART_Init(&tWifi_UART_Handle);
//
//    tWifi_UART_Handle.Init.BaudRate     = 115200;//57600;
//    tWifi_UART_Handle.Init.WordLength   = UART_WORDLENGTH_8B;
//    tWifi_UART_Handle.Init.StopBits     = UART_STOPBITS_1;
//    tWifi_UART_Handle.Init.Parity       = UART_PARITY_NONE;
//    tWifi_UART_Handle.Init.Mode         = UART_MODE_TX_RX;
//    tWifi_UART_Handle.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
//    tWifi_UART_Handle.Init.OverSampling = UART_OVERSAMPLING_8;
//    tWifi_UART_Handle.Instance          = USART2;
//    eHAL_Status = HAL_UART_Init(&tWifi_UART_Handle);
//
//    if(eHAL_Status == HAL_OK)
//    {
//      eEC = ER_OK;
//      tBSP_AS.bIs_Wifi_Intf_Init = true;
//    }
//    else
//    {
//      eEC = ER_FAIL;
//      tBSP_AS.bIs_Wifi_Intf_Init = false;
//    }
//
//    tWifi_GPIO_Init.Pin    = GPIO_PIN_0;
//    tWifi_GPIO_Init.Mode   = GPIO_MODE_OUTPUT_PP;
//    tWifi_GPIO_Init.Pull   = GPIO_NOPULL;
//    tWifi_GPIO_Init.Speed  = GPIO_SPEED_HIGH;
//    HAL_GPIO_Init(GPIOA,&tWifi_GPIO_Init);
    tBSP_AS.bIs_Wifi_Intf_Init = true;
  }
  else
  {
    eEC = ER_OK;
  }
  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: Filename_or_abreviation_funciton
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
static ERROR_CODE eBSP_Usb_Intf_Init(void)
{
  ERROR_CODE eEC = ER_FAIL;

  //The low level interface initialization is handled by the 3rd party driver
  if(tBSP_AS.bIs_Usb_Intf_Init == false)
  {
    tBSP_AS.bIs_Usb_Intf_Init = true;
  }

  eEC = ER_OK;

  return eEC;
}

static uint32_t uiGetUartBits(UART_DATA_BITS eDataBits)
{
  uint32_t uiBits = 0xFFFFFFFF;
  if((DATA_BITS_INVALID < eDataBits)&(eDataBits < DATA_BITS_LIMIT))
  {
    if(eDataBits == DATA_BITS_9)
      uiBits = UART_WORDLENGTH_9B;
    else if(eDataBits == DATA_BITS_8)
      uiBits = UART_WORDLENGTH_8B;
  }

  return uiBits;
}

static uint32_t uiGetUartParity(UART_PARITY eParity)
{
  uint32_t uiParity = 0xFFFFFFFF;
  if((PARITY_INVALID < eParity)&(eParity < PARITY_LIMIT))
  {
    if(eParity == PARITY_NONE)
      uiParity = UART_PARITY_NONE;
    else if(eParity == PARITY_EVEN)
      uiParity = UART_PARITY_EVEN;
    else if(eParity == PARITY_ODD)
      uiParity = UART_PARITY_ODD;
    else if(eParity == PARITY_MARK)
      uiParity = UART_PARITY_NONE;
  }

  return uiParity;
}

static uint32_t uiGetUartStopBits(UART_STOP_BITS eStopBits)
{
  uint32_t uiStopBits = 0xFFFFFFFF;
  if((STOP_BITS_INVALID < eStopBits)&(eStopBits < STOP_BITS_LIMIT))
  {
    if(eStopBits == STOP_BITS_1)
      uiStopBits = UART_STOPBITS_1;
    else if(eStopBits == STOP_BITS_2)
      uiStopBits = UART_STOPBITS_2;
  }

  return uiStopBits;
}

static uint32_t   uiGetUartFlowControl(UART_FLOW_CONTROL eControl)
{
  uint32_t uiFlowControl = 0xFFFFFFFF;

  if((FLOW_CONTROL_INVALID < eControl)&(eControl < FLOW_CONTROL_LIMIT))
  {
    if(eControl == FLOW_CONTROL_NONE)
      uiFlowControl = UART_HWCONTROL_NONE;
    else if(eControl == FLOW_CONTROL_RTS)
      uiFlowControl = UART_HWCONTROL_RTS;
    else if(eControl == FLOW_CONTROL_CTS)
      uiFlowControl = UART_HWCONTROL_CTS;
    else if(eControl == FLOW_CONTROL_RTS_CTS)
      uiFlowControl = UART_HWCONTROL_RTS_CTS;
  }
  return uiFlowControl;
}

static uint32_t uiGetUartMode(UART_MODE eMode)
{
  uint32_t uiMode = 0xFFFFFFFF;

  if((MODE_NONE < eMode)&(eMode < MODE_LIMIT))
  {
    if(eMode == MODE_TX)
      uiMode = UART_MODE_TX;
    else if(eMode == MODE_RX)
      uiMode = UART_MODE_RX;
    else if(eMode == MODE_TX_RX)
      uiMode = UART_MODE_TX_RX;
  }

