Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
  return uiMode;
}

/******************************************************************************
* public functions ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Camera_Intf_Send(pBSP_Camera_Send pParam)
{
  ERROR_CODE eEC = ER_FAIL;

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Camera_Intf_Receive(pBSP_Camera_Receive pParam)
{
  ERROR_CODE eEC = ER_FAIL;

  return eEC;
}

ERROR_CODE eBSP_BT_INTF_SEND(pBSP_BT_Send pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;

//  eHAL_Status = HAL_USART_Transmit(&tWifi_UART_Handle, pParam->pBuff, pParam->uiBuff_Len, 3000);
  eHAL_Status = HAL_UART_Transmit(&BT_UART_HANDLE, pParam->pBuff, pParam->uiLen, 3000);

//  vDEBUG((char *)pParam->pBuff);

  if(eHAL_Status == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

ERROR_CODE eBSP_BT_INTF_RCV(pBSP_BT_Rcv pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;

  eHAL_Status = HAL_UART_Receive_IT(&BT_UART_HANDLE, pParam->pBuff, pParam->uiLen);
  if(eHAL_Status == HAL_OK)
    eEC = ER_OK;
  else if(eHAL_Status == HAL_BUSY)
    eEC = ER_TIMEOUT;
  else
    eEC = ER_FAIL;

  return eEC;
}

ERROR_CODE eBSP_BT_INTF_CONFIG(pUART_Config pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  ERROR_CODE eEC_MX = ER_NONE;
  ERROR_CODE eEC_CB = ER_NONE;
  ERROR_CODE eEC_RCV_TO_CB = ER_NONE;
  ERROR_CODE eEC_SEND_TO_CB = ER_NONE;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;
  extern UART_HandleTypeDef BT_UART_HANDLE;

  if(((DATA_BITS_INVALID    < pParam->eDataBits)&(pParam->eDataBits < DATA_BITS_LIMIT   )) &
     ((PARITY_INVALID       < pParam->eParity  )&(pParam->eParity   < PARITY_LIMIT      )) &
     ((STOP_BITS_INVALID    < pParam->eStopBits)&(pParam->eStopBits < STOP_BITS_LIMIT   )) &
     ((FLOW_CONTROL_INVALID < pParam->eControl )&(pParam->eControl  < FLOW_CONTROL_LIMIT)) &
     ((MODE_NONE            < pParam->eMode    )&(pParam->eMode < MODE_LIMIT            )) &
      (                   0 < pParam->uiBaud))
  {
    BT_UART_HANDLE.Init.WordLength = uiGetUartBits       (pParam->eDataBits);
    BT_UART_HANDLE.Init.Parity     = uiGetUartParity     (pParam->eParity);
    BT_UART_HANDLE.Init.StopBits   = uiGetUartStopBits   (pParam->eStopBits);
    BT_UART_HANDLE.Init.HwFlowCtl  = uiGetUartFlowControl(pParam->eControl);
    BT_UART_HANDLE.Init.Mode       = uiGetUartMode       (pParam->eMode);
    BT_UART_HANDLE.Init.BaudRate   = pParam->uiBaud;
    eHAL_Status = HAL_UART_Init(&BT_UART_HANDLE);

    if(eHAL_Status == HAL_OK)
      eEC_MX = ER_OK;
    else
      eEC_MX = ER_FAIL;
  }

  if(pParam->vUART_ISR != NULL)
  {

  }

  if(pParam->vUART_Rcv_Timeout_ISR != NULL)
  {

  }

  if(pParam->vUART_Send_Timeout_ISR != NULL)
  {

  }

  if(((eEC_MX == ER_NONE)        |(eEC_MX == ER_OK))        &
     ((eEC_CB == ER_NONE)        |(eEC_CB == ER_OK))        &
     ((eEC_RCV_TO_CB == ER_NONE) |(eEC_RCV_TO_CB == ER_OK)) &
     ((eEC_SEND_TO_CB == ER_NONE)|(eEC_SEND_TO_CB == ER_OK)))
  {
    eEC = ER_OK;
  }
  else
  {
    if(eEC_MX == ER_FAIL)
      eEC = ER_PARAM;
    else if(eEC_CB == ER_FAIL)
      eEC = ER_PARAM1;
    else if(eEC_RCV_TO_CB == ER_FAIL)
      eEC = ER_PARAM2;
    else if(eEC_SEND_TO_CB == ER_FAIL)
      eEC = ER_PARAM3;
  }

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_Rst_Clr(void)
{
  ERROR_CODE eEC = ER_OK;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_Rst_Set(void)
{
  ERROR_CODE eEC = ER_OK;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_En_Clr(void)
{
  ERROR_CODE eEC = ER_OK;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET);

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_En_Set(void)
{
  ERROR_CODE eEC = ER_OK;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET);

  return eEC;
}

