Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
/******************************************************************************
* todo: DESCRIPTION, PARAM, RETURN
* name: eBSP_Wifi_Intf_Config
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_Intf_Config(pUART_Config pConfig)
{
  ERROR_CODE eEC = ER_FAIL;

  if((pConfig->eDataBits) & (pConfig->eParity  ) &
     (pConfig->eStopBits) & (pConfig->eControl ) &
     (pConfig->uiBaud   ))
  {
    /*config the uart*/
  }

  if(pConfig->vUART_ISR != NULL)
  {

  }

  if(pConfig->vUART_Rcv_Timeout_ISR != NULL)
  {

  }

  if(pConfig->vUART_Send_Timeout_ISR != NULL)
  {

  }

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_Intf_Send(pBSP_Wifi_Transmit pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;

//  eHAL_Status = HAL_USART_Transmit(&tWifi_UART_Handle, pParam->pBuff, pParam->uiBuff_Len, 3000);
  eHAL_Status = HAL_UART_Transmit(&WIFI_UART_HANDLE, pParam->pBuff, pParam->uiBuff_Len, 3000);

//  vDEBUG((char *)pParam->pBuff);

  if(eHAL_Status == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* name: eBSP_Wifi_Intf_Receive
******************************************************************************/
ERROR_CODE eBSP_Wifi_Intf_Receive(pBSP_Wifi_Receive pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;

  if(pParam->bBlocking == true)
  {
    eHAL_Status = HAL_UART_Receive(&WIFI_UART_HANDLE, pParam->pBuff, pParam->uiBuff_Len, pParam->uiTimeout);
    if(eHAL_Status == HAL_OK)
      eEC = ER_OK;
    else if(eHAL_Status == HAL_TIMEOUT)
      eEC = ER_TIMEOUT;
    else
      eEC = ER_FAIL;
  }
  else
  {
    eHAL_Status = HAL_UART_Receive_IT(&WIFI_UART_HANDLE, pParam->pBuff, pParam->uiBuff_Len);
    if(eHAL_Status == HAL_OK)
      eEC = ER_OK;
    else if(eHAL_Status == HAL_BUSY)
      eEC = ER_TIMEOUT;
    else
      eEC = ER_FAIL;
  }

  return eEC;
}

/******************************************************************************
* name: eBSP_FLASH_READ
******************************************************************************/
ERROR_CODE eBSP_FLASH_READ(pBSP_Flash_Read pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  uint32_t uiReadAddress = pParam->uiStart_Addr;
  uint32_t uiIndex = 0;

  while(uiIndex < pParam->uiBuff_Len)
  {
    pParam->pBuff[uiIndex++] = *(__IO uint32_t*)uiReadAddress++;//FLASH_SETTINGS_INDEX;//pParam->uiStart_Addr[uiIndex];
  }

  eEC = ER_OK;

  return eEC;
}

/******************************************************************************
* name: eBSP_FLASH_WRITE
******************************************************************************/
ERROR_CODE eBSP_FLASH_WRITE(pBSP_Flash_Write pParam)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_EC = HAL_ERROR;
  uint32_t uiStartSector;
  uint32_t uiEndSector;
  uint32_t uiSectorIndex;
  uint32_t uiData;

  uiStartSector = ADDR_FLASH_SECTOR_11;
  uiSectorIndex = uiStartSector;
  uiEndSector = uiStartSector + pParam->uiBuff_Len;

  eHAL_EC = HAL_FLASH_Unlock();
  vDEBUG_ASSERT("eBSP_FLASH_WRITE unlock fail", eHAL_EC == HAL_OK);

  //todo: disable interrupts

  /* Clear pending flags (if any) */
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);

  while(uiSectorIndex < uiEndSector)
  {
    uiData = 0;
    uiData |= (uint32_t)pParam->pBuff[3];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[2];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[1];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[0];
    eHAL_EC = HAL_FLASH_Program(TYPEPROGRAM_WORD, uiSectorIndex, uiData);
    if(eHAL_EC != HAL_OK)
    {
      break;
    }
    pParam->pBuff += 4;
    uiSectorIndex += 4;
  }
  //todo: enable interrupts
  vDEBUG_ASSERT("eBSP_FLASH_WRITE program fail", eHAL_EC == HAL_OK);

  eHAL_EC = HAL_FLASH_Lock();
  vDEBUG_ASSERT("eBSP_FLASH_WRITE lock fail", eHAL_EC == HAL_OK);

  if(eHAL_EC == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* name: eBSP_FLASH_GET_START_ADDR
******************************************************************************/
ERROR_CODE eBSP_FLASH_GET_START_ADDR(uint32_t * pStartAddr)
{
  ERROR_CODE eEC = ER_FAIL;

  if(pStartAddr != NULL)
  {
    *pStartAddr = FLASH_USER_START_ADDR;
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* name: eBSP_FLASH_ERASE
******************************************************************************/
ERROR_CODE eBSP_FLASH_ERASE(void)
{
  ERROR_CODE eEC = ER_FAIL;
  uint32_t fault_sec = 0;
  HAL_StatusTypeDef eHAL_EC = HAL_ERROR;

  FLASH_EraseInitTypeDef er
  = {
      .TypeErase = TYPEERASE_SECTORS,
      .Sector = FLASH_SECTOR_11,
      .NbSectors = 1,
      .VoltageRange = VOLTAGE_RANGE_3
  };

  HAL_FLASH_Unlock();
  eHAL_EC = HAL_FLASHEx_Erase(&er, &fault_sec);
  vDEBUG_ASSERT("HAL_FLASHEx_Erase fail", eHAL_EC == HAL_OK);
  HAL_FLASH_Lock();

  if(eHAL_EC == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* todo: DESCRIPTION
* name: eBSP_SystemClock_Config
* description:
* param description: none
* return value description: ERROR_CODE - ER_OK: System clock configured
*                                      - ER_FAIL: System clock configuration process failed
******************************************************************************/
ERROR_CODE eBSP_SystemClock_Config(void)
{

  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_STATUS = HAL_ERROR;

  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

